INSERT INTO `book`(`ISBN`, `title`, `number_of_pages`, `publication_date`) VALUES 
('4534712345783','Война и мир',1567,2020),
('3444332656564','Анна Каренина',1280,2019),
('6787878755775','Мастер и Маргарита',541,2020),
('1209990876565','Осенний лис',615,2020),
('5645645656456','Хроники Нарнии',1034,2018),
('4565677776667','Семь сестёр',630,2019),
('1234231144487','11/22/63',780,2018),
('6767644455535','Воскресение',893,2017),
('1211647978787','Двенадцать стульев',450,2018),
('6754476733661','Одноэтажная Америка',378,2019)

INSERT INTO `author`(`first_name`, `last_name`) VALUES 
('Лев','Толстой'),
('Михаил','Булгаков'),
('Дмитрий','Скирюк'),
('Клайв','Льюис'),
('Люсинда','Райли'),
('Стивен','Кинг'),
('Илья','Ильф'),
('Евгений','Петров')


INSERT INTO `book_author`(`id_book`, `id_author`) VALUES 
(1,1),
(2,1),
(3,2),
(4,3),
(5,4),
(6,5),
(7,6),
(8,1),
(9,7),
(9,8),
(10,7),
(10,8)


INSERT INTO `genre`(`name`) VALUES 
('Классическая литература'),
('Детская литература'),
('Фантастика'),
('Современная проза'),
('Фэнтези')


INSERT INTO `book_genre`(`id_book`, `id_genre`) VALUES 
(1,1),
(2,1),
(3,1),
(4,4),
(4,5),
(5,2),
(5,5),
(6,4),
(7,3),
(7,4),
(8,1),
(9,1),
(10,1)

